# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# - 0,56 -> 11

# num=input('input number ')
# sum=0
# for i in num:  
#     if ord(i)>47 and ord(i)<58 : 
#         sum=sum+int(i)
# print (f'- {num} -> {sum}')



# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# num=int(input('input number '))
# print (f'- пусть N = {num}, тогда [', end=' ')
# result=1
# count=0
# for i in range(1,num+1):            # подсчитывает и выводит результаты произведение
#     result*=i
#     print (f'{result}', end=' ')
#     if i<num: print (f',', end=' ')
#     else: print (']', end=' (')
# for m in range(1,num+1):            # отображает множители
#     countt=1    
#     while countt<=m:       
#         print (f'{countt}', end='')
#         countt+=1
#         if countt<=m: print (f'*', end='')
#     if m<num: print (f',', end=' ')
#     else: print (')', end='')
        
  
  
# Задайте список из k чисел последовательности (1 + 1\k)^k и выведите на экран их сумму.




# Задайте список из N элементов, заполненных числами из промежутка [-N, N].



# Найдите произведение элементов на указанных пользователем через пробел позициях.



# Реализуйте алгоритм перемешивания списка.